hw2/DeliverableDocuments/SOAP/booktickets_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:bookTickets xmlns:ns2="http://flight_reservation">
            <arg0>1337</arg0>
            <arg1>
                <Date>2017-02-04T01:12:39.489+01:00</Date>
                <Flight>
                    <DepartmentCity>Stockholm</DepartmentCity>
                    <DestinationCity>Madrid</DestinationCity>
                </Flight>
                <Price>150.0</Price>
            </arg1>
            <arg1>
                <Date>2017-02-04T01:12:39.489+01:00</Date>
                <Flight>
                    <DepartmentCity>Madrid</DepartmentCity>
                    <DestinationCity>Mumbai</DestinationCity>
                </Flight>
                <Price>300.0</Price>
            </arg1>
            <arg2>ID2208_AUTH_TOKEN</arg2>
        </ns2:bookTickets>
    </S:Body>
</S:Envelope>