hw2/DeliverableDocuments/SOAP/top_down/itineraries_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns3:getItineraries xmlns:ns2="http://id2208.se.kth.top_down.FlightTicketReservationServiceTopDown"
                            xmlns:ns3="http://flight_reservation">
            <arg0>Stockholm</arg0>
            <arg1>Madrid</arg1>
            <arg2>ID2208_AUTH_TOKEN</arg2>
        </ns3:getItineraries>
    </S:Body>
</S:Envelope>